hiperiondev/esp32idf_APRS/components/message/message.c
size_t message_next_json(uint32_t after_seq, char *out, size_t out_size, uint32_t *out_seq) {
    if (out_seq)
        *out_seq = after_seq;
    if (out == NULL || out_size < MSG_JSON_ENTRY_MAX)
        return 0;

    // Walking by the insertion counter is what puts the thread in conversation
    // order: an entry keeps the position it was given when it entered the queue,
    // which is what makes a message that is still being retried stay where the
    // operator wrote it instead of climbing back to the bottom of the panel on
    // every attempt. Driving the walk off the counter rather than off slot order
    // also means a message evicted part-way through a response is skipped
    // instead of repeated or misplaced.
    const msg_entry_t *e = NULL;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        const msg_entry_t *c = &s_queue[i];
        if (!c->used || c->seq <= after_seq)
            continue;
        if (!e || c->seq < e->seq)
            e = c;
    }
    if (!e)
        return 0;

    char call_esc[sizeof(e->callsign) * 2];
    char text_esc[MSG_TEXT_MAX * 2];
    json_escape(e->callsign, call_esc, sizeof(call_esc));
    json_escape(e->text, text_esc, sizeof(text_esc));

    const char *status = e->rxtx ? "rx" : (e->ack > 0 ? "pending" : "sent");

    // out_size is at least MSG_JSON_ENTRY_MAX, which the static assertion above
    // ties to these field widths, so this cannot truncate.
    int len = snprintf(out, out_size, "{\"time\":%lld,\"dir\":\"%s\",\"call\":\"%s\",\"text\":\"%s\",\"status\":\"%s\"}", (long long)e->time,
                       e->rxtx ? "rx" : "tx", call_esc, text_esc, status);
    if (len < 0)
        return 0;

    if (out_seq)
        *out_seq = e->seq;
    return (size_t)len;
}

// Builds and sends one packet per enabled channel from a shared "info"
// field (":ADDRESSEE:text{id" or ":ADDRESSEE:ackNNN"), rather than one
// packet reused verbatim on both channels.
//
// The RF leg gets the operator-configured digipeater path (g_config.msg_path,
// resolved by aprs_path_build_suffix_from_config()). The APRS-IS leg does not:
// WIDEn-N aliases are RF-only and meaningless (and misleading to other IS
// clients/servers) once a packet is injected straight into APRS-IS. Per
// APRS-IS convention, locally-originated traffic sent to the IS network
// carries a "TCPIP*" q-construct tag in its path instead of an RF unproto path
// - see aprsc/javAPRSSrvr behavior and the APRS-IS server spec - so the IS leg
// carries "TCPIP*" rather than something like "WIDE1-1,WIDE2-1".
// True when a message addressed to toCall must leave over APRS-IS alone.
//
// Two kinds of addressee qualify, for the same reason: neither is on the local
// channel, so every RF copy of a message addressed to it is airtime spent on a
// receiver that is not there, multiplied by g_config.msg_retry for as long as
// the message goes unacked.
//
// The first is an addressee registered with message_set_inet_only_peer(): a
// service that lives on the Internet, recognised by its address alone. The
// second is a station whose most recent frame reached this gateway as
// BrandMeister traffic, recognised from the last-heard table.
//
// The rule may only ever REMOVE the RF leg, never add the Internet one. If
// g_config.msg_inet is off the operator has said this station does not put
// messages on APRS-IS, and neither kind of addressee is a reason to override
// that - it is a reason to send nothing, which is what returning false here
// and letting the two flags stand achieves.
//
// The answer is derived at each transmission rather than recorded with the
// queued message on purpose: the BrandMeister half follows the last-heard
// table, so a station that turns up on the local channel between one attempt
// and the next has its retries put on the air without anything having to
// invalidate a stored decision.
static bool destIsInetOnly(const char *toCall) {
    if (!g_config.msg_inet)
        return false;
    if (toCall == NULL || toCall[0] == 0)
        return false;
    // A registered peer is an addressee that lives on the Internet rather than
    // on the local channel, so its RF leg is suppressed by the address alone,
    // without anything having to have been heard first.
    if (s_inetOnlyPeer[0] != 0 && callsignBaseMatch(toCall, s_inetOnlyPeer))
        return true;
    if (!g_config.bm_en || !g_config.bm_msg_inet_only)
        return false;
    return lastheard_last_seen_bm(toCall);
}

static void txPacket(const char *myCall, const char *toCall, const char *info) {
    if (!s_txHandler) {
        ESP_LOGW(TAG, "No TX handler registered, dropping: %s", info);
        return;
    }

    const bool inetOnly = destIsInetOnly(toCall);
    if (inetOnly && g_config.msg_rf)
        ESP_LOGD(TAG, "%s is reachable over the Internet - RF leg suppressed, sending over APRS-IS only", toCall);
    // str_append() reports whether the whole frame fit and leaves len at the
    // number of characters actually written. Both matter here: len is handed
    // straight to the TX handler, which memcpy()s and send()s exactly that
    // many bytes from packet[], so it has to be a count of what is really in
    // the buffer. A frame that does not fit is dropped with a warning rather
    // than sent short - the same discipline the beacon builders follow -
    // because a truncated APRS message loses its trailing "{id" sequence
    // suffix and would never be acked.
    if (g_config.msg_rf && !inetOnly) {
        // The path presets are snapshotted under app_config_lock() inside the
        // builder; msg_path itself is a single byte, read here the same way the
        // msg_rf/msg_inet flags around it are.
        char path[80];
        aprs_path_build_suffix_from_config(g_config.msg_path, path, sizeof(path));
        char packet[400];
        size_t len = 0;
        if (str_append(packet, sizeof(packet), &len, "%s>" APRS_TOCALL "%s:%s", myCall, path, info))
            s_txHandler(packet, len, MSG_CHANNEL_RF);
        else
            ESP_LOGW(TAG, "RF message too long for a %u byte frame, dropped: %s", (unsigned)sizeof(packet), info);
    }
    if (g_config.msg_inet) {
        char packet[400];
        size_t len = 0;
        if (str_append(packet, sizeof(packet), &len, "%s>" APRS_TOCALL APRS_PATH_TCPIP_SUFFIX ":%s", myCall, info))
            s_txHandler(packet, len, MSG_CHANNEL_INET);
        else
            ESP_LOGW(TAG, "INET message too long for a %u byte frame, dropped: %s", (unsigned)sizeof(packet), info);
    }
}

// Copies as much of src into dst as fits in APRS_MSG_TEXT_STD_MAX bytes,
// dropping any '|', '~', CR, LF and '{' along the way. str_copy_strip_reserved()
// handles '|' and '~', reserved for the base-91 comment telemetry group
// (APRS101 ch.13); str_copy_strip_line_breaks() removes CR and LF, since the
// finished message line is written to APRS-IS and to the AX.25 TNC2 text
// form as a single line and neither format escapes an embedded one; '{' is
// dropped here on top of both, since message text also reserves it as the
// message-number delimiter (APRS101 ch.14), unlike the free-text fields
// str_copy_strip_reserved() is otherwise used for.
//
// Message text is 8-bit-clean and passed through unchanged, so an operator's
// UTF-8 comment travels on the air exactly as typed (aprs.org/aprs12/utf-8.txt).
// The byte budget is still enforced after both filters for that reason:
// str_copy_utf8_safe() makes any cut needed to reach APRS_MSG_TEXT_STD_MAX
// land on a whole character rather than through the middle of one, and the
// '{' strip below, run last, never lengthens the string, so it cannot undo
// that boundary once str_copy_utf8_safe() has set it. dst is always
// NUL-terminated; dst_size must be at least 1.
static void sanitizeOutgoingText(const char *src, char *dst, size_t dst_size) {
    size_t cap = dst_size < APRS_MSG_TEXT_STD_MAX + 1 ? dst_size : APRS_MSG_TEXT_STD_MAX + 1;

