hiperiondev/esp32idf_APRS/components/message/message.c
    // Neither filter here ever lengthens the string, so this buffer only
    // needs room for src as typed, not for cap: the byte budget itself is
    // enforced next, by str_copy_utf8_safe().
    char stripped[MSG_TEXT_MAX];
    char no_breaks[MSG_TEXT_MAX];
    str_copy_strip_reserved(src, stripped, sizeof(stripped));
    str_copy_strip_line_breaks(stripped, no_breaks, sizeof(no_breaks));
    str_copy_utf8_safe(no_breaks, dst, cap);

    size_t out = 0;
    for (size_t i = 0; dst[i]; i++)
        if (dst[i] != '{')
            dst[out++] = dst[i];
    dst[out] = 0;
}

void sendAPRSMessage(const char *toCall, const char *text) {
    if (!toCall[0] || !text[0])
        return;
    // Bump the outbound APRS message number. It must always increment and must
    // never come out as 0: a "{0" suffix is read by many APRS clients (UI-View
    // / APRSIS32 / Xastir) as "no message number", so the message would never
    // get acked. Past MSG_ID_MAX it wraps back to 1, which keeps the number two
    // digits wide and leaves room for the Reply-ACK suffix inside the five
    // characters APRS101 allows a message identifier.
    if (++s_msgID > MSG_ID_MAX)
        s_msgID = 1;

    char myCallUp[10];
    app_config_lock();
    strncpy(myCallUp, g_config.msg_mycall, sizeof(myCallUp) - 1);
    app_config_unlock();
    myCallUp[sizeof(myCallUp) - 1] = 0;
    trimUpper(myCallUp);

    char toCallUp[10];
    strncpy(toCallUp, toCall, sizeof(toCallUp) - 1);
    toCallUp[sizeof(toCallUp) - 1] = 0;
    trimUpper(toCallUp);

    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    memcpy(toCallFixed, toCallUp, strlen(toCallUp) > 9 ? 9 : strlen(toCallUp));

    // Enforced here rather than trusted to the caller, so the on-air text
    // length and character set stay correct regardless of where the call
    // came from: truncated to the standard APRS message text length and
    // stripped of the characters APRS101 reserves for telemetry and the
    // message-number delimiter.
    char payload[APRS_MSG_TEXT_STD_MAX + 1];
    sanitizeOutgoingText(text, payload, sizeof(payload));

    char suffix[8];
    buildMsgNumberSuffix(toCallUp, s_msgID, suffix, sizeof(suffix));

    char info[320];
    snprintf(info, sizeof(info), ":%s:%s%s", toCallFixed, payload, suffix);

    txPacket(myCallUp, toCallUp, info);
    ESP_LOGD(TAG, "Send APRS message to %s msgID %u: %s", toCall, (unsigned)s_msgID, info);

    // A message this station originates is routed to Telegram on the same
    // terms as one it receives: the addressee decides the recipient, so a
    // message the operator sends from the Snd/Rcv Msg page to a callsign
    // listed on the Telegram page reaches that user's own chat. What is
    // routed is the sanitized payload, which is the text that actually went
    // on the air, and the message number suffix is left out of it because it
    // addresses the radio protocol rather than the person reading the line.
    //
    // An addressee in the bulletin range is routed as the broadcast it is,
    // to every account the bot knows, so the origin of a bulletin never
    // decides who reads it. Only the first transmission is routed; the
    // retries sendAPRSMessageRetry() sends carry the same text to the same
    // addressee and would otherwise arrive as duplicates of a line already
    // delivered.
    if (payload[0] != 0) {
        if (isBulletinAddressee(toCallUp))
            telegram_app_notify_bulletin(myCallUp, toCallUp, payload);
        else
            telegram_app_notify_station_message(myCallUp, toCallUp, payload);
    }

    int8_t ackVal = (g_config.msg_retry == 0) ? -2 : (int8_t)g_config.msg_retry;
    // The trimmed upper-case addressee is what goes in the queue, matching the
    // form the callsign takes on the air. An incoming ack is matched against
    // this field by exact comparison, and it is also the name the chat page
    // shows next to the message. The sanitized payload is stored rather than
    // the caller's raw text, so a retry re-sends exactly what was already put
    // on the air instead of re-deriving it.
    pkgMsgStore(toCallUp, payload, s_msgID, ackVal, false, false);
}

void sendAPRSAck(const char *toCall, const char *msgNo) {
    char toCallFixed[10];
    memset(toCallFixed, ' ', 9);
    toCallFixed[9] = 0;
    size_t n = strlen(toCall);
    memcpy(toCallFixed, toCall, n > 9 ? 9 : n);

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    char info[160];
    snprintf(info, sizeof(info), ":%s:ack%s", toCallFixed, msgNo);
    // An ack follows the same route as the message it answers: the addressee
    // here is the station that sent it, and if that station is only reachable
    // over the network then so is its acknowledgement.
    txPacket(myCall, toCall, info);
    ESP_LOGD(TAG, "Send APRS ACK to %s msgNo %s", toCall, msgNo);
}

int message_send_pending_to(const char *toCall) {
    if (toCall == NULL || toCall[0] == 0)
        return 0;

    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    int sent = 0;
    int held = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        // ack > 0 is the "outbound and still waiting for an ack" state; an
        // acked (-2), rejected (-3) or received (-1) entry is not something
        // this station is holding for the querying operator.
        if (!s_queue[i].used || s_queue[i].rxtx || s_queue[i].ack <= 0)
            continue;
        if (!callsignBaseMatch(s_queue[i].callsign, toCall))
            continue;

        // One query answers with a handful of frames, not with the whole
        // queue: MSG_QUERY_BURST_MAX bounds how long the transmitter can stay
        // keyed on behalf of a single question. The rest of the loop only
        // counts what is left over - those slots keep their retry state, so
        // sendAPRSMessageRetry() carries them at the configured interval,
        // which is the paced path this traffic already has.
        if (sent >= MSG_QUERY_BURST_MAX) {
            held++;
            continue;
        }

        // The retry counter and timestamp are deliberately left alone: this
        // transmission answers a query, so it must not spend one of the
        // message's own delivery attempts nor push the next scheduled retry
        // out by one interval.
        char toCallFixed[10];
        memset(toCallFixed, ' ', 9);
        toCallFixed[9] = 0;
        size_t n = strlen(s_queue[i].callsign);
        memcpy(toCallFixed, s_queue[i].callsign, n > 9 ? 9 : n);

        char payload[300];
        strncpy(payload, s_queue[i].text, sizeof(payload) - 1);
        payload[sizeof(payload) - 1] = 0;

        char suffix[8];
        buildMsgNumberSuffix(s_queue[i].callsign, s_queue[i].msgID, suffix, sizeof(suffix));

