hiperiondev/esp32idf_APRS/components/message/message.c
        char info[320];
        snprintf(info, sizeof(info), ":%s:%s%s", toCallFixed, payload, suffix);
        txPacket(myCall, s_queue[i].callsign, info);
        sent++;
    }

    if (sent > 0) {
        if (held > 0)
            ESP_LOGI(TAG, "?APRSM from %s answered with %d pending message(s), %d left to the retry timer", toCall, sent, held);
        else
            ESP_LOGI(TAG, "?APRSM from %s answered with %d pending message(s)", toCall, sent);
    }
    return sent;
}

void sendAPRSMessageRetry(void) {
    time_t now = time(NULL);

    // Snapshot the own-call once, so a web save can't rewrite it mid-loop
    // while frames are being built.
    char myCall[10];
    app_config_lock();
    memcpy(myCall, g_config.msg_mycall, sizeof(myCall));
    app_config_unlock();
    // The copy above takes the full field width, so termination depends on
    // what the config loader stored. Force it: everything downstream treats
    // this as a C string, and a field filled edge to edge would send it
    // reading past the end of the local buffer.
    myCall[sizeof(myCall) - 1] = 0;

    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used || s_queue[i].ack <= 0)
            continue;
        if ((now - s_queue[i].last_tx) <= g_config.msg_interval)
            continue;

        // Stamp the moment this retry is sent. The guard above compares
        // (now - last_tx) against msg_interval, so the timestamp must be the
        // instant of the last transmission for the next attempt to fall
        // exactly one msg_interval later. It is a separate field from the
        // creation time the chat page displays, which stays put: a message is
        // dated when it was written, not when it was last put on the air.
        if (--s_queue[i].ack > 0)
            s_queue[i].last_tx = now;

        char toCallFixed[10];
        memset(toCallFixed, ' ', 9);
        toCallFixed[9] = 0;
        size_t n = strlen(s_queue[i].callsign);
        memcpy(toCallFixed, s_queue[i].callsign, n > 9 ? 9 : n);

        char payload[300];
        strncpy(payload, s_queue[i].text, sizeof(payload) - 1);
        payload[sizeof(payload) - 1] = 0;

        char suffix[8];
        buildMsgNumberSuffix(s_queue[i].callsign, s_queue[i].msgID, suffix, sizeof(suffix));

        char info[320];
        snprintf(info, sizeof(info), ":%s:%s%s", toCallFixed, payload, suffix);
        txPacket(myCall, s_queue[i].callsign, info);
        ESP_LOGD(TAG, "Retry APRS message[%d] to %s msgID %u ack left %d", i, s_queue[i].callsign, (unsigned)s_queue[i].msgID, s_queue[i].ack);
    }
}

// ---------------------------------------------------------------------------
// Incoming
//
// A message body is delivered as the text it is. None of the APRS 1.2
// message-payload proposals (aprs.org/aprs12.html) is recognised as a class
// of its own:
//   - FREQ-in-MSG, the "QSY?"/"QSY!" frequency request/command: this station
//     drives no synthesiser it could query or retune in answer.
//   - OBJECT-in-MSG and ITEM-in-MSG, which carry a full object/item report
//     inside a message payload as a workaround for stations that cannot
//     digipeat the ordinary object/item packet: this station has no map to
//     plot one on and neither originates nor needs the workaround.
// All three are thinly deployed proposals, and a message using one still
// reaches the operator verbatim on the chat page, which is where a request a
// human can act on belongs.
// ---------------------------------------------------------------------------
void handleIncomingAPRS(const char *line, query_source_t source) {
    if (line == NULL)
        return;

    // The information field is what follows the first ':' of the TNC2 line: a
    // TNC2 header is a source address, a destination address and a digipeater
    // path, none of which can hold a ':', so the first one always ends the
    // header and nothing before it is payload.
    const char *header_end = strchr(line, ':');
    if (header_end == NULL)
        return;

    const char *info = header_end + 1;

    // ":ADDRESSEE:text" (APRS101 chapter 14). The addressee field is a fixed
    // nine characters, so the closing ':' is always at info[10]; this is the
    // same test aprs_filter_classify_info() applies, which is what keeps a
    // frame shown on the chat page and a frame this station's own classifier
    // calls a message the one set. Free text that happens to read like a
    // message - inside a status report, a position comment or an object - is
    // not one, and is left where it belongs.
    if (info[0] != ':' || strlen(info) < 11 || info[10] != ':')
        return;

    char fromCall[16] = { 0 };
    const char *gt = memchr(line, '>', (size_t)(header_end - line));
    if (gt) {
        size_t n = (size_t)(gt - line);
        if (n >= sizeof(fromCall))
            n = sizeof(fromCall) - 1;
        memcpy(fromCall, line, n);
    }
    // Callsigns travel upper case on the air; normalising the sender here keeps
    // one spelling for the whole path it feeds - the queue entry the chat page
    // shows, the exact match that pairs an incoming ack with the outbound
    // message it acknowledges, and the addressee of the ack sent back.
    trimUpper(fromCall);

    // Addressee: info[1..9], the nine characters between the two ':' the test
    // above located.
    char toCall[12] = { 0 };
    memcpy(toCall, info + 1, 9);
    trimUpper(toCall);

    if (strcasecmp(fromCall, toCall) == 0)
        return; // message to self, ignore

    // Closing ':' of the addressee field, so colon[1] is the first byte of the
    // message text.
    const char *colon = info + 10;

    // Directed query ("CALL:?query?") shares this same ":ADDRESSEE:" framing
    // but is not an APRS message: hand it to the query responder's own
    // addressee-parsing entry point instead of duplicating it here, and skip
    // the message-specific logic below entirely. Checked - and dispatched -
    // regardless of g_config.msg_enable, since the two features are
    // independently enabled (g_config.query_en gates it inside query.c).
    if (colon[1] == '?') {
        // The whole line goes along with the split-out fields: a "?APRST" /
        // "?PING?" answer reports the route the query travelled, which only
        // the unparsed line still carries. The source travels with it too,
        // since it decides both whether the query is answered and where the
        // answer goes.
        query_process_directed(fromCall, toCall, colon + 1, line, source);
        return;
    }

    // Telegram routing is a consumer of this frame in its own right, with its
    // own switches on the Telegram page, so the text is decoded before the
    // messaging service's own switch is consulted and the routing below runs
    // whether or not this station keeps the message for itself. Everything
    // past that test - the acceptance rule, the acknowledgement, the alarm
    // pulse and the chat history - belongs to the messaging service and stays
    // behind it.
    bool msg_service_on = g_config.msg_enable;
    if (!msg_service_on && !telegram_app_routing_active())
        return;

