hiperiondev/esp32idf_APRS/components/message/message.c
    char message[300] = { 0 };
    strncpy(message, colon + 1, sizeof(message) - 1);
    // trim trailing whitespace/CR
    size_t mlen = strlen(message);
    while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
        message[--mlen] = 0;

    char msgNo[12] = { 0 };
    char *brace = strchr(message, '{');
    if (brace && brace[1]) {
        strncpy(msgNo, brace + 1, sizeof(msgNo) - 1);
        *brace = 0;
        mlen = strlen(message);
        while (mlen > 0 && isspace((unsigned char)message[mlen - 1]))
            message[--mlen] = 0;
    }

    // A message text starting with "ack"/"rej" is only classified as such when
    // the remainder is a valid message-number field, exactly as APRS101 defines
    // the literal "ack"/"rej" followed by the message number and nothing else;
    // otherwise it is ordinary text ("acknowledged, thanks", "rejoining net")
    // and falls through to the message-storing path below.
    bool isAck = (strncmp(message, "ack", 3) == 0) && isValidMsgNoField(message + 3);
    if (isAck) {
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);
        msgNo[sizeof(msgNo) - 1] = 0;
    }

    bool isRej = (strncmp(message, "rej", 3) == 0) && isValidMsgNoField(message + 3);
    if (isRej) {
        strncpy(msgNo, message + 3, sizeof(msgNo) - 1);
        msgNo[sizeof(msgNo) - 1] = 0;
    }

    ESP_LOGD(TAG, "Message from %s to %s: %s", fromCall, toCall, message);

    // Handed to the Telegram bot ahead of this station's own acceptance test.
    // The callsigns of the authorized users configured on the Telegram page
    // are an addressee set of their own, unrelated to g_config.msg_mycall, so
    // a message addressed to one of them is routed to that user's own
    // Telegram account whether or not this station reads the frame itself.
    // Only readable text travels: an ack or a rej carries none, and an empty
    // text is nothing to deliver. A no-op unless the operator has turned
    // "Route Station messages" on for a bot that is actually running.
    if (!isAck && !isRej && message[0] != 0)
        telegram_app_notify_station_message(fromCall, toCall, message);

    // A bulletin is handed to the bot on the same terms, and by the same
    // reasoning: a bulletin is addressed to the whole network rather than to
    // any station, so it reaches every account the bot is configured to talk
    // to instead of being matched against a callsign. Bulletins arrive both
    // off the air and from the APRS-IS feed and are repeated by their
    // originator and by every digipeater that hears them, so the routing
    // itself drops a bulletin identical to one it delivered recently. A
    // no-op unless the operator has turned "Route Bulletins" on for a bot
    // that is actually running.
    if (!isAck && !isRej && message[0] != 0 && isBulletinAddressee(toCall))
        telegram_app_notify_bulletin(fromCall, toCall, message);

    // Everything from here on is the messaging service's own work on a frame
    // it keeps, so it happens only when that service is switched on.
    if (!msg_service_on)
        return;

    // Reply-ACK split. msgNo keeps the identifier whole, because an ack has to
    // quote it back exactly as it arrived; ownNo is the sender's own number and
    // replyAck the free acknowledgement riding with it, empty when the sender
    // sent none. On an "ackMM}AA" line the trailing part is this station's own
    // free acknowledgement quoted back, not an acknowledgement of anything, so
    // only ownNo is used there.
    char ownNo[8];
    char replyAck[8];
    splitReplyAck(msgNo, ownNo, sizeof(ownNo), replyAck, sizeof(replyAck));

    // Accept the message either addressed to this station - the addressee's
    // base callsign matches ours regardless of SSID on either side, so a
    // message to "N0CALL", "N0CALL-7", etc. is accepted as long as the
    // configured mycall is "N0CALL", with or without its own SSID - or
    // addressed to a message group this station reads (APRS101 chapter 14):
    // the built-in "ALL"/"QST"/"CQ" set, or one of g_config.msg_group[].
    // isDirect is what the rest of this function routes every "acknowledge
    // it" / "remember a Reply-ACK for it" / "pulse the alarm for it" decision
    // on, never on acceptance alone: a group has no single owner to send an
    // ack back, and every member reading it would otherwise answer at once.
    bool isDirect = callsignBaseMatch(toCall, g_config.msg_mycall);
    bool isGroup = !isDirect && isGroupAddressee(toCall);
    if (!isDirect && !isGroup)
        return;

    // An ack or rej always carries a message ID (it's the ID of the queued
    // message being acknowledged/rejected); without one there is nothing to
    // match against a queued outgoing message, so it can't be processed. A
    // group address can't carry one either: an ack/rej is a reply to this
    // station's own outbound message, which is only ever sent to a callsign,
    // never to a group.
    if ((isAck || isRej) && (msgNo[0] == 0 || isGroup))
        return;

    uint16_t number;

    if (isAck || isRej) {
        // The observer is told about the acknowledgement whatever it does with
        // it, and the queue is updated regardless of what it answers: an
        // outbound message that has been acknowledged must stop being retried
        // no matter who else is interested in the fact.
        if (s_rxObserver) {
            uint16_t ackID = 0;
            parseMsgNumber(ownNo, &ackID);
            s_rxObserver(fromCall, message, ackID, true);
        }
        int i = parseMsgNumber(ownNo, &number) ? pkgMsg_Find(fromCall, number, false) : -1;
        if (i >= 0)
            s_queue[i].ack = isAck ? -2 : -3; // acked, or rejected by recipient: stop retrying, don't count as delivered
        return;
    }

    char decoded[300];
    strncpy(decoded, message, sizeof(decoded) - 1);
    decoded[sizeof(decoded) - 1] = 0;

    size_t dlen = strlen(decoded);
    while (dlen > 0 && isspace((unsigned char)decoded[dlen - 1]))
        decoded[--dlen] = 0;
    if (dlen == 0)
        return;

