hiperiondev/esp32idf_APRS/components/message/message.c
    // A free acknowledgement riding with the message clears the outbound
    // message it names, so a reply doubles as the ack for what it replies to
    // and no separate "ackNN" has to survive the return path. Meaningless for
    // a group message - this station never sent an outbound message to a
    // group for one to acknowledge - so skipped entirely for one.
    if (!isGroup && parseMsgNumber(replyAck, &number)) {
        int i = pkgMsg_Find(fromCall, number, false);
        if (i >= 0)
            s_queue[i].ack = -2;
    }

    // Every received message is a new line of the conversation and gets a queue
    // slot of its own; only a copy of one already in the history is left out,
    // and even then the ack below still goes back out for a direct message,
    // since a repeat means the sender never heard the first one. The message
    // is identified by the sender's own number and its direct/group status, so
    // two copies carrying different free acknowledgements are still one
    // message, while a group message and a direct message that happen to
    // share a sender and number are two.
    uint16_t rxID = 0;
    parseMsgNumber(ownNo, &rxID);

    // A subsystem that holds a conversation with a service over APRS messaging
    // takes its own traffic here, before any of it reaches the chat history. It
    // is offered the message only once it has been recognised as addressed to
    // this station and split into its fields, so it never has to parse a frame
    // itself, and the acknowledgement below is sent whatever it answers,
    // because the sender asked for one and is waiting.
    bool consumed = false;
    if (s_rxObserver)
        consumed = s_rxObserver(fromCall, decoded, rxID, false);

    if (!consumed && pkgMsgFindRepeat(fromCall, decoded, rxID, true, isGroup) < 0)
        pkgMsgStore(fromCall, decoded, rxID, -1, true, isGroup);

    // A group message is never acked, never retransmitted and never
    // auto-replied to, "{id" suffix or not - it has no single owner to answer
    // it, and answering on behalf of the whole group would key the
    // transmitter for every member that heard it. Per APRS101 the message ID
    // is otherwise optional: for a direct message, only send an ack when the
    // sender actually requested one. That ack quotes the identifier whole,
    // Reply-ACK suffix included, and the sender's own number becomes the
    // acknowledgement owed back to that station.
    if (!isGroup) {
        if (msgNo[0] != 0) {
            sendAPRSAck(fromCall, msgNo);
            replyAckRemember(fromCall, ownNo);
        }
        // The alarm announces traffic the operator has to come and read. A
        // message an observer took is being dealt with by whatever took it, so
        // there is nothing waiting and nothing to announce.
        if (!consumed)
            message_alarm_pulse();
    }
}
